# Rebar Constraints Manager Get Constraint Candidates For Handle Method

Source: https://www.revitapidocs.com/2026/96d684e3-2ec9-37ee-cfd0-2aa4b09e28fc.htm

---

| Rebar Constraints Manager Get Constraint Candidates For Handle Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetConstraintCandidatesForHandle(RebarConstrainedHandle, ElementId) | For shape driven rebar returns all possible RebarConstraints belonging to references from the provided element that could be used for a specified RebarConstrainedHandle. For free form rebar will return an empty list. |
|  | GetConstraintCandidatesForHandle(RebarConstrainedHandle, Reference) | For shape driven rebar returns all possible RebarConstraints that will constrain RebarConstrainedHandle to the provided reference. For free form rebar will return an empty list. |

Top See Also

#### Reference

RebarConstraintsManager Class Autodesk.Revit.DB.Structure Namespace